Revit 2026 API

# LinkLoadResult Class

---

This class stores the results of trying to load a single linked model.

SystemObject Autodesk.Revit.DBLinkLoadResult

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkLoadResult : IDisposable
```
```vb
Public Class LinkLoadResult
	Implements IDisposable
```
```cpp
public ref class LinkLoadResult : IDisposable
```
```fsharp
type LinkLoadResult =
    class
        interface IDisposable
    end
```

The LinkLoadResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LinkLoadResult | Constructs a new uninitialized LinkLoadResult object. |
|  | LinkLoadResult(LinkLoadResult) | Constructs a new copy of the input LinkLoadResult object. |

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The id of the created or loaded linked model. |
|  | IsCircularLink | True if these results are part of a link cycle. |
|  | IsNested | True if these results represent a nested link; false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadResult | Holds the results of creating or loading a link. Results can be LinkLoadResultType.LinkLoaded for success, or a variety of errors. See LinkLoadResultType for the full list. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LinkLoadResult |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCentralModelName | Gets the central model's name. If the link is not workshared, this returns an empty FilePath. If the link is itself a central model, this returns the link's name. |
|  | GetExternalResourceReference | Gets a copy of the ExternalResourceReference corresponding to the link. |
|  | GetExternalResourceReferencesFromFailedLoads | Searches this and all nested LinkLoadResults, and returns a list of ExternalResourceReferences for the links that failed to load. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLinkLoadResult | Searches this LinkLoadResult and all nested LinkLoadResults for the load operation results of a specified ExternalResourceReference. |
|  | GetModelName | Gets the name of the model. |
|  | GetNestedLinkLoadResults | Gets the results for this link's nested links. |
|  | GetParentModelName | Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCodeSuccess | Check if load result code signifies success. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace